import{d as e}from"./index-mHww9zLL.js";const t=[{id:"a-1",name:"Reconquista",description:"Цей альбом присвячений темам відродження, боротьби за національну ідентичність та збереження традиційних цінностей. Музика пронизана духом історичної спадщини та нагадує про героїчні часи, коли народи об'єднувалися задля досягнення великої мети.",link:"https://www.youtube.com/embed/GPGemQOs8fY?si=o6KLkLtUUpWlu0Mr"},{id:"a-2",name:"WHISPER OF RUNES - Templum Victoriae",description:"Альбом присвячений темам спадщини предків, воїнського духу, містики та величі перемоги. У піснях багато згадок про стародавні традиції, природу, боротьбу та честь. Музика поєднує народні мелодії з важчим, роковим звучанням, створюючи атмосферу, яка занурює слухача у світ давніх легенд і ритуалів. Це музика про силу духу, пам’ять поколінь і шлях воїна.",link:"https://www.youtube.com/embed/0RjgIWcsszA?si=S2ieoMfda2aK-4ma"},{id:"a-3",name:"Unbreakable Faith",description:"Цей альбом є маніфестом віри у власні сили, ідеї та традиції. Композиції наповнені мотивами непохитної стійкості перед викликами сучасності, відданості своїм переконанням і прагненню до особистого та колективного зростання.",link:"https://www.youtube.com/embed/yTQhAgqcj6g?si=3vSLnJcSYv3c5Bto"},{id:"a-4",name:"Nekrokrator",description:"Агресивний і похмурий альбом, що досліджує теми влади, хаосу та неминучості змін у світі. Через важкі рифи та глибоку лірику передається атмосфера апокаліптичного бачення сучасної реальності.",link:"https://www.youtube.com/embed/aqalZW1DMTE?si=T3tVT4JNYAnmmguu"},{id:"a-5",name:"Shield and Sword",description:"Тематика альбому охоплює ідеї честі, героїзму, непохитної віри у свої переконання та готовності захищати їх за будь-яких обставин. Композиції сповнені енергії, відданості ідеалам, а також глибокими символами боротьби за духовне і культурне відродження. Через потужні рифи, мелодійні вставки та агресивний вокал гурт передає послання про те, що щит і меч — це не лише фізичні інструменти, але й внутрішній стан, що дозволяє долати будь-які перешкоди на шляху до правди.",link:"https://www.youtube.com/embed/8_HVDscjpBs?si=CgAyDionCziqh8Bg"},{id:"a-6",name:"WHISPER OF RUNES - CRYSTAL KNIGHT",description:'Основний акцент робиться на образі кристального лицаря — символі чистоти, сили духу і непохитної волі. Цей реліз досліджує тематику зв’язку з древніми традиціями, мудрістю предків і боротьбою за правду. "Шепіт рун" у назві натякає на езотеричне знання, приховані істини, які відкриваються лише тим, хто готовий слухати та розуміти. Музика альбому сповнена епічності: поєднання атмосферних мелодій, важких рифів і вокалу створює відчуття героїчного епосу. Кожна композиція розповідає історію боротьби, духовного пошуку і досягнення внутрішнього балансу через випробування. "Crystal Knight" символізує образ ідеального воїна, який не лише майстерний у битві, але й керується високими ідеалами та чистими помислами.',link:"https://www.youtube.com/embed/cW7rnaxIJYk?si=nWXH7KlBIdBXHEg8"},{id:"a-7",name:"WJ 2.0",description:"Альбом зосереджений на концепціях боротьби за ідентичність, історичної пам’яті та зв’язку поколінь. Через важкі рифи, агресивний вокал та похмурі тексти він досліджує теми відданості ідеалам, незламності у світі змін і хаосу. WJ 2.0 символізує еволюцію як музичного стилю гурту, так і ідей, які вони несуть.",link:"https://www.youtube.com/embed/YCzRM2WLkzk?si=3p0zAGJgWr5iII5b"},{id:"a-8",name:"Coup de grâce",description:"Фінальний удар, що символізує завершення боротьби та досягнення остаточної мети. Альбом відображає теми перемоги над внутрішніми та зовнішніми перешкодами, а також незворотність змін у житті.",link:"https://www.youtube.com/embed/v-D_uVk1H7E?si=LGy6sUIUn9vL5grt"},{id:"a-9",name:"PRE-M8L8TH - 2001 DEMO ERA SONG",description:"Композиція має похмурий, бойовий і меланхолійний настрій, поєднуючи елементи блек-металу та націоналістичної ідеології, що є характерними для гурту. У тексті згадуються таємниці часу, жорстокість долі, світло і темрява, що проходять крізь життя людини, а також готовність прийняти свою долю, йти до кінця заради вищої мети. Музично трек витриманий у традиціях сирого блек-металу, з характерним жорстким вокалом, швидкими гітарними рифами та похмурою атмосферою.",link:"https://www.youtube.com/embed/gn2kvLAuUgM?si=Oe8AOBgNGLoaM98y"}],s=()=>t,r=i=>t.find(o=>o.id===i),a=e.div`
  width: 928px;
  flex-direction: column;
  display: flex;
  justify-content: center;
  gap: 16px;
`,c=e.div`
  border: 1px solid white;
  width: 928px;
  height: 64px;
  border-radius: 4px;
  transition: background-color 0.5s ease, color 0.5s ease;
  color: white;

  &:hover {
    background-color: white;
    color: black;
  }

  > a {
    text-decoration: none;
    display: block;
    padding: 10px;
    color: inherit;
    transition: color 0.5s ease;
  }
  h3 {
    color: inherit;
    height: 32px;
    width: 928px;
    display: flex;
    align-items: center;
  }
`,d=e.h3`
  color: white;
`,p=e.h3`
  color: white;
`,m=e.h3`
  margin-top: 30px;
  font-weight: 200;
  color: white;
`;export{a as C,p as P,m as a,c as b,d as c,s as d,r as g};
